Repository: jiya-talreja/multi_language_detection
Catalog: backend/input/opus/en-hi.tmx
Source language: en
Languages: hi

source: We should do away with the death penalty.
hi: हमें मौत की सज़ा को हटा देना चाहिए।

source: We must rescue the environment from pollution.
hi: हमें पर्यावरण को प्रदूषण से बचाना चाहिए।

source: We investigated the matter from all angles.
hi: हमने मामले की हर पहलू से छानबीन करी।

source: We voted for the candidate.
hi: हमने उस उम्मीदवार को चुना।

source: We stayed at a hotel by the lake.
hi: हम झील के पास एक होटल में ठहरे।

source: We saw the film and had dinner together.
hi: हमने एक साथ फ़िल्म देखी और खाना खाया।

source: We were surprised at the news.
hi: हम खबर सुनकर चौंक गए।

source: We talked to each other for a while.
hi: हमने थोड़ी देर के लिए एक-दूसरे के साथ बात करी।

source: We are in agreement on this subject.
hi: हम इस विषय पर सहमत हैं।

source: Our class consists of fifty boys.
hi: हमारी क्लास में पचास लड़के हैं।

source: Our new head office is in Tokyo.
hi: हमारा नया प्रधान कार्यालय टोकियो में है।

source: Our meeting rarely starts on time.
hi: हमारी मीटिंग कभी-कभार ही टाईम पर शुरू होती है।

source: Our team won the game.
hi: हमारी टीम ने खेल जीता।

source: My name is Hopkins.
hi: मेरा नाम हॉपकिंस है।

source: Would you carry my luggage upstairs?
hi: क्या तुम मेरा सामान ऊपर ले जाओगे?

source: The vase was broken to pieces.
hi: गुलदान टूट कर चूर-चूर हो गया।

source: Bees are flying among the flowers.
hi: फूलों के बीच मधुमक्खियाँ उड़ रहीं हैं।

source: The bride suddenly laughed.
hi: दुल्हन अचानक से हँस पड़ी।

source: The flowers were dying without water.
hi: फूल पानी के बिना मरे जा रहे थे।

source: Flowers bloom.
hi: फूल खिलते हैं।

source: I'll expect to hear from you by Tuesday.
hi: मैं मंगलवार के आने से पहले तुमसे खबर सुनने की उम्मीद रखूँगा।

source: Are you free on Tuesday?
hi: तुम मंगलवार को खाली हो क्या?

source: Fire! Run!
hi: आग! भागो!

source: Twenty people perished in the blaze.
hi: आग में बीस लोगों की मौत हो गई।

source: Fire is very dangerous.
hi: आग बहुत खतरनाक होती है।

source: Fire burns.
hi: आग जलाती है।

source: As he had no way of making fire, he ate the fish raw.
hi: वह आग जला नहीं सकता था, इसलिए उसने मछली को कच्चा खाया।

source: The fruits are dried in the sun.
hi: फलों को धूप में सुखाया जाता है।

source: What do you do in your free time?
hi: तुम अपने खाली समय में क्या करते हो?

source: The house was in flames.
hi: घर आग में लिपटा हुआ था।

source: I had to help with the housework.
hi: मुझे घर के कामकाज में मदद करनी पड़ी।

source: I will give you a call as soon as I get home.
hi: मैं घर पहुँचते ही तुम्हें फ़ोन करूँगी।

source: We're goin' home.
hi: हम घर चलत हैं।

source: Summer is the season I like best.
hi: गर्मी का मौसम मेरा सबसे पसंदीता मौसम है।

source: Thousands of foreigners visit Japan every year.
hi: हज़ारों विदेशी हर साल जापान जाते हैं।

source: Some of the boys are fishing and the others are swimming.
hi: कुछ लड़के मछलियाँ पकड़ रहे हैं, और बाकी तैर रहे हैं।

source: What time does it open?
hi: कितने बजे खुलता है?

source: Nothing happened.
hi: कुछ नहीं हुआ।

source: Why didn't you come?
hi: तुम क्यों नहीं आए?

source: What should I eat?
hi: मुझे क्या खाना चाहिए?

source: Come on!
hi: आओ!

source: What for?
hi: किस वजह से?

source: You may take anything you like.
hi: तुम्हें जो अच्छा लगता है लेलो।

source: You shall not have your own way in everything.
hi: तुम हर काम केवल अपनी मर्ज़ी से ही नहीं कर सकते।

source: Anything will do.
hi: कुछ भी चलेगा।

source: What's new?
hi: क्या नया है?

source: There must be another way.
hi: कोई और रास्ता भी होगा।

source: Can I help you?
hi: क्या मैं आपकी सहायता कर सकता हूँ?

source: If something does happen, I'll just play it by ear.
hi: अगर कुछ हो भी जाता है तो मैं कोई-न-कोई जुगाड़ कर लूँगा।

source: I think there has been some misunderstanding here.
hi: मुझे लगता है कि यहाँ कुछ ग़लतफ़ैमी हुई है।

source: What do you want me to do?
hi: तुम मुझसे क्या करवाना चाहते हो?

source: I wonder what happened.
hi: पता नहीं क्या हुआ।

source: I'll give you a present.
hi: मैं तुम्हें एक तोहफ़ा दूँगा।

source: What is over there?
hi: वहां क्या है?

source: What shall I do for you?
hi: मैं आपके लिए क्या कर सकता हूँ?

source: Is there anything that I can do for you?
hi: क्या मैं आपके लिए कुछ कर सकता हूं?

source: Anything new?
hi: कुछ नई बात?

source: Correct the underlined words.
hi: रेखांकित शब्दों को सुधारिए।

source: I listen to music.
hi: मैं संगीत सुनता हूँ।

source: No music, no life.
hi: संगीत नहीं तो जान नही।

source: The temperature falls.
hi: तापमान गिरता है।

source: Was I wrong?
hi: क्या मैं ग़लत था?

source: Don't worry about me.
hi: मेरी चिंता मत करो।

source: Let me handle this.
hi: यह मुझे संभालने दो।

source: The bird on the roof is a crow.
hi: छत पर जो चिड़िया बैठी है वह एक कौआ है।

source: That's Tom's house with the red roof.
hi: लाल छत वाला वह टॉम का घर है।

source: The king turned out to be naked.
hi: राजा तो नंगा निकला।

source: There's a rich man sleeping on a golden bed.
hi: एक अमीर आदमी सुनहरे बिस्तर पर सो रहा है।

source: The king ordered that the prisoner should be set free.
hi: राजा ने हुक़्म दिया कि क़ैदी को रिहा कर दिया जाए।

source: The king crushed his enemies.
hi: राजा ने अपने दुश्मनों को कुचल दिया।

source: The king abused his power.
hi: राजा ने अपनी ताकत का दुरुपयोग किया।

source: The king governed the country.
hi: राजा की देश पर हुकूमत थी।

source: Pollution has a disastrous effect on the ecology of a region.
hi: प्रदूषण का किसी भी क्षेत्र की परिस्थिति पर बहुत ही हानिकारक प्रभाव पड़ता है।

source: I bought a dozen pencils today.
hi: मैने आज एक डर्जन पेन्सिलें खरीदीं।

source: They heard a gun go off in the distance.
hi: उनको दूर से बंदूक की आवाज़ सुनाई दी।

source: Seen from distance, the rock looked like a human face.
hi: दूर से देखने में वह पत्थर एक आदमी के चेहरे की तरह दिखता था।

source: Don't say such a thing.
hi: ऐसी बात मत बोलो।

source: Nobody else offered to help.
hi: किसी और ने मदद करने की इच्छा प्रकट नहीं करी।

source: His pride didn't allow him to ask for help.
hi: उसने अपने अभिमान की वजह से किसी से भी मदद नहीं मांगी।

source: I ran into an old friend of mine outside the station.
hi: मुझे स्टेशन के बाहर अपना एक पुराना दोस्त मिल गया।

source: Let me give you a lift as far as the station.
hi: मुझे तुम्हें स्टेशन तक पहुँचाने दो।

source: The station is nearby.
hi: स्टेशन पास में है।

source: We must hurry if we want to arrive at the station on time.
hi: अगर हमको स्टेशन समय पर पहुँचना है तो हमको जल्दी करनी होगी।

source: London, the capital of England, is on the Thames.
hi: इंग्लैंड की राजधानी लंदन थेम्स नदी के किनारे है।

source: Don't be afraid to make mistakes when speaking English.
hi: अंग्रेज़ी बोलते समय गलतियों का डर नहीं होना चाहिए।

source: Don't be afraid of making mistakes when speaking English.
hi: अंग्रेज़ी बोलने के समय ग़लतियों से मत डरा करो।

source: Is it hard to speak English?
hi: अंग्रेज़ी बोलना मुश्किल होता है क्या?

source: Speaking English is a lot of fun.
hi: अंग्रेज़ी बोलने में बड़ा मज़ा आता है।

source: Teaching English is his profession.
hi: अंग्रेज़ी पढ़ाना उसका पेशा है।

source: Learning English is hard work.
hi: अंग्रेज़ी सीखना कड़ी मेहनत का काम है।

source: I've studied English for five years.
hi: मैंने पाँच साल के लिए अंग्रेज़ी पढ़ी है।

source: English is studied in Japan.
hi: जापान में अंग्रेज़ी पढ़ी जाती है।

source: English is studied in China, too.
hi: चीन में भी अंग्रेज़ी सीखी जाती है।

source: English has spread all over the country.
hi: अंग्रेज़ी देश भर में फैल गयी है।

source: English is the world's language.
hi: अंग्रेज़ी वैश्विक भाषा है।

source: English is an international language.
hi: अंग्रेज़ी एक अंतर्राष्ट्रीय भाषा है।

source: English is not difficult to learn.
hi: अंग्रेजी सीखने में मुश्किल नहीं है।

source: English is spoken in many countries.
hi: अंग्रेज़ी कई देशों में बोली जाती है।

source: English is taught in most countries.
hi: ज़्यादातर देशों में अंग्रेज़ी सिखाई जाती है।

source: English is spoken in America.
hi: अमेरिका में अंग्रेजी बोली जाती है।

source: English words are often borrowed by other languages.
hi: अंग्रेज़ी भाषा के शब्द बहुत सी और भाषाओं में उधार लिए जातें हैं।

source: Answer in English.
hi: अंग्रेज़ी में जवाब दो।

source: Try to improve your English.
hi: अपनी अंग्रेज़ी सुधारने की कोशिश करो।

source: How I wish I could swim.
hi: काश मुझे तैरना आता।

source: How about going to the movies?
hi: फ़िल्म देखने चलें क्या?

source: You're going to a movie?
hi: फ़िल्म देखने जा रहे हो?

source: We must not speak ill of others behind their backs.
hi: हमे लोगों की पीठ के पीछे उनकी बुराई नहीं करनी चाहिए।

source: The clouds are breaking.
hi: बादल छंट रहे हैं।

source: The rumor turned out false.
hi: वह अफ़वाह झूठी निकली।

source: The rumor turned out true.
hi: अफ़वा सच निकली।

source: The rain hasn't stopped yet, has it?
hi: बारिश अभी तक रुकी नहीं है, है ना?

source: The rain continued all day.
hi: बरसात पूरे दिन होती रही।

source: I go to the office by bicycle except on rainy days.
hi: उन दिनों के सिवाय जब बारिश हो रही होती है, मैं साईकल चलाकर काम पर जाता हूँ।

source: The rain prevented me from coming.
hi: मैं बारिश की वजह से आ नहीं पाया।

source: Because of the rain they had to cancel the game.
hi: बारिश की वजह से उन्हें खेल रद्द करना पड़ा।

source: It looks like rain. You had better take an umbrella with you.
hi: लगता है कि बारिश होगी। तुम्हे छाता लेकर जाना चाहिए।

source: When it rains, it pours.
hi: जब बारिश होती है, तो ज़बरदस्त होती है।

source: Unless it rains, I will go, too.
hi: अगर बारिश नहीं होती है तो मैं भी जाऊँगा।

source: Absence of rain caused the plants to die.
hi: पौधे बारिश के बिना मर गए।

source: The rain was falling in my face.
hi: बारिश मेरे चेहरे पर गिर रही थी।

source: He closed the window for fear of rain.
hi: उसने खिड़की को बंद कर दिया क्योंकि उसको बारिश होने का डर था।

source: A crow is as black as coal.
hi: कौआ कोयले जैसा काला होता है।

source: The space ship will get to the moon soon.
hi: यह अंतरिक्ष यान जल्द जी चाँद तक पहुँचेगा।

source: There is no air in space.
hi: अंतरिक्ष में हवा नहीं होती है।

source: My right foot is sleeping.
hi: मेरा दाहिना पैर सो गया है।

source: You should not speak ill of others behind their backs.
hi: तुमको लोगों कि पीठ के पीछे उनकी बुराई नहीं करनी चाहिए।

source: You should not speak of others behind their backs.
hi: तुम्हे लोगों की पीठ-पीछे बात नहीं करनी चाहिए।

source: Don't speak ill of others behind their back.
hi: दूसरों की पीठ-पीछे बुराई मत किया करो।

source: I drank too much. My face is swollen!
hi: मैंने कुछ ज़्यादा ही पी लिया है। मेरा पूरा चेहरा सूज गया है!

source: I'll give you an answer in a day or two.
hi: मैं तुम्हें एक-दो दिन में जवाब दूँगा।

source: At a glance I knew that he was tired.
hi: मुझे एक झलक देखते ही पता लग गया कि वह थक गई थी।

source: One is tall and the other is short.
hi: एक लम्बा है और दूसरा छोटा है।

source: On the one hand, you are wrong, but on the other hand, I can't blame you for that.
hi: तुम ग़लत तो ज़रूर हो, पर मैं इसके लिए तुम्हें दोषी भी नहीं ठहरा सकता।

source: You can hear English on Channel 1, and Japanese on Channel 7.
hi: आप चैनल १ पर अंग्रेज़ी सुन सकते हैं, और चैनल ७ पर जापानी।

source: A day has twenty-four hours.
hi: एक दिन में चौबीस घंटे होते हैं।

source: Can the rumor be true?
hi: क्या यह अफ़वाह सच हो सकती है?

source: Is it about ten million yen?
hi: तकरीबन दस एक अरब येन होंगे?

source: She allowed him to go alone.
hi: उसने उसको अकेले जाने दिया।

source: Do you want to come along?
hi: तुम साथ आना चाहते हो क्या?

source: It has been raining on and off since the day before yesterday.
hi: परसों से बारिश रुक रुक के हो रही है।

source: Let me give you a piece of advice.
hi: मैं तुम्हें एक बात की सलाह देता हूँ।

source: In a word, I think he's a fool.
hi: एक शब्द में कहूँ तो, मुझे लगता है वो बेवकूफ़ है।

source: I don't like being made a fool of.
hi: मुझे मूर्ख बनना पसंद नहीं है।

source: You must send for the doctor.
hi: तुम्हें डॉक्टर बुलाना होगा।

source: The doctor told her that she should take a rest.
hi: डॉक्टर ने उससे कहा कि उसे आराम लेना चाहिए।

source: The doctor felt his pulse.
hi: डॉक्टर ने उसकी नब्ज़ ली।

source: The doctor told him to cut down on smoking.
hi: डॉक्टर ने उसे सिगरेट कम पीने को कहा।

source: The doctor advised him not to smoke.
hi: डॉक्टर ने उसे सिगरेट न पीने की सलह दी।

source: The doctor felt my pulse.
hi: डॉक्टर ने मेरी नब्ज़ ली।

source: The doctor bound my wounds.
hi: डॉक्टर ने मेरी चोटों पर पट्टी लगाई।

source: It is necessary that you see a doctor.
hi: तुम्हारे लिए डॉक्टर को देखने जाना ज़रूरी है।

source: The doctor advised that she take a holiday.
hi: डॉक्टर ने उसको छुट्टी लेने की सलाह दी।

source: He died without having made a will.
hi: वह वसीयत बनाए बिना ही मर गया।

source: Wrong.
hi: गलत।

source: Do you feel any pain in your stomach?
hi: क्या आपको पेट में दर्द महसूस हो रहा है?

source: He who can, does. He who cannot, teaches.
hi: जो कर सकता है वह करता है। जो नहीं कर सकता, वह सिखाता है।

source: You may sit down on the chair.
hi: तुम कुरसी पर बैठ सकते हो।

source: I lost consciousness.
hi: मैं बेहोशी में चला गया।

source: The committee consists of twelve members.
hi: समिति में बारह सदस्य हैं।

source: The majority of the committee voted against the bill.
hi: समिति के अधिकांश सदस्यों ने बिल के पारित होने के खिलाफ़ मत दिया।

source: Many great men went through hardship during their youth.
hi: कई महान पुरुषों को अपने जवानी में कठिनाई का सामना करना पड़ा।

source: There used to be a church here.
hi: यहाँ एक चर्च हुआ करता था।

source: There used to be a hut about here.
hi: यहाँ आसपास में एक झोपड़ी हुआ करती थी।

source: Having seen him before, I recognized him.
hi: मैंने उसे पहले देखा हुआ था, इसलिए मैंने उसे पहचान लिया।

source: There used to be a big pond around here.
hi: यहाँ एक बड़ा तालाब हुआ करता था।

source: It's getting dark. You'd better go home.
hi: दिन ढल रहा है। तुम्हे घर जाना चाहिए।

source: Stay quiet and rest.
hi: शांत रहो और आराम करो।

source: Speak of the devil and he is sure to appear.
hi: शैतान का नाम लो और शैतान ज़रूर हाज़िर हो जाएगा।

source: How easily one acquires bad habits!
hi: बुरी आदतें कितनी आसानी से लग जातीं हैं!

source: We should keep our promise.
hi: हमे अपना वादा निभाना चाहिए।

source: We were all very happy at breakfast.
hi: हम सब नाश्ते के समय बहुत खुश थे।

source: I'm tired now.
hi: मैं अब थक गया हूँ।

source: I was able to play piano very well.
hi: मैं पियानो बहुत अच्छा बजा लेता था।

source: I prefer coffee to tea.
hi: मुझे चाय से ज़्यादा कॉफ़ी पसंद है।

source: I am a student at Oxford University.
hi: मैं ऑक्सफ़र्ड विश्वविद्यालय में विद्यार्थी हूँ।

source: He has been to India.
hi: वह भारत गया हुआ है।

source: I want to travel with you.
hi: मैं तुम्हारे साथ सफ़र करना चाहता हूँ।

source: I am at home.
hi: मैं घर पर हूँ।

source: I am more beautiful than you.
hi: मैं तुमसे ज़्यादा खूबसूरत हूँ।

source: It seems to me that you are wrong.
hi: मुझे लगता है कि तुम ग़लत हो।

source: We should love our neighbors.
hi: हमे पड़ोसियों के साथ प्रेमपूर्वक रहना चहिए।

source: Our country is in a crisis.
hi: हमारा देश संकट में है।

source: We import tea from India.
hi: हम भारत से चाय का आयात करते हैं।

source: There is no satisfying spoiled children.
hi: बिगड़े हुए बच्चों को खुश नहीं कर सकते।

source: Yes, I'll be right there.
hi: हाँ, मैं बस अभी आता हूँ।

source: London is one of the largest cities in the world.
hi: लंदन दुनिया के सबसे बड़े शहरों में से एक है।

source: The people of London are very proud of this bridge.
hi: लंदन के लोगों को इस ब्रिज पर गर्व है।

source: I have been to London before.
hi: मैं पहले भी लन्दन जा चुकी हूँ.

source: The Romans worshiped their goddess, Juno.
hi: रोमन अपनी देवी, जूनो, की पूजा करते थे।

source: Rome is in Italy.
hi: रोम इटली में है।

source: Let go of the rope.
hi: रस्सी को छोड़ दो।

source: A rope was thrown into the water.
hi: रस्सी को पानी में फेंक दिया गया।

source: A button has come off my raincoat.
hi: मेरे रेनकोट से एक बटन निकल आया है।

source: Lucy is certain to come.
hi: लूसी ज़रूर आएगी।

source: Has Lucy telephoned yet?
hi: लूसी ने फ़ोन किया है क्या?

source: Lucy likes playing tennis.
hi: लूसी को टेनीस खेलना पसंद है।

source: Louie, your friends are coming.
hi: लुई, तुम्हारे दोस्त आ रहे हैं।

source: I am eating an apple.
hi: मैं सेव खा रहा हूँ ।

source: Half of the apples are rotten.
hi: आधे सेव सड़ चुके हैं।

source: The life of Lincoln is read by children all over the world.
hi: लिन्कोन की जीवनी दुनिया भर के बच्चे पड़ते हैं.

source: Lincoln died in 1865.
hi: लिंकन की मौत १८६५ में हुई थी।

source: Lincoln ordered that all the slaves in the country should be set free.
hi: लिंकनने देश के सभी घुलामों को आजाद़ करने का हुक्म दिया।

source: Please relax.
hi: कृप्या आराम कीजिए।

source: Squirrels are quick of movement.
hi: गिलहरियाँ बहुत ही फुर्तीलीं होतीं हैं।

source: A squirrel hid among the branches.
hi: एक गिलहरी डालियों के बीच छुपी हुई थी।

source: Turn on the radio.
hi: रेडियो को चालू करो।

source: Lions feed on flesh.
hi: शेर मास खाते हैं।

source: The lion is the king of the jungle.
hi: शेर जंगल का राजा है।

source: What's the difference between lions and leopards?
hi: शेर और तेंदुओं में फरक क्या होता है?

source: You are doing very well. Keep it up.
hi: तुम अच्छा काम कर रहे हो। ऐसे ही करते रहो।

source: Good news was in store for us at home.
hi: हमारे लिए खुशखबरी घर पर इंतेज़ार कर रही थी।

source: Walk slowly.
hi: धीरे चल।

source: Take your time.
hi: आराम से आओ।

source: Work slowly.
hi: धीरे काम कर।

source: Drive slowly.
hi: गाड़ी धीरे चला।

source: Did you feel the earth shake last night?
hi: क्या तुमने कल रात धरती को हिलते हुए महसूस किया था?

source: Much still remains to be done.
hi: करने के लिए अभी और बहुत बचा है।

source: At last, the truth became known to us.
hi: आखिरकार हमे सच्चाई का पता चल गया।

source: Molly has a large clock.
hi: मॉली के पास एक बड़ी घडी़ है।

source: The haze enveloped London.
hi: लंदन में धुंध छा गई थी।

source: There is no longer any room for doubt.
hi: शक की कोई गुंजाईश नहीं रही है।

source: Louder.
hi: और जोर से।

source: Louder, please.
hi: ज़रा और ज़ोर से, कृप्या।

source: Do you have a larger size?
hi: आपके पास इससे बड़े नाप का है क्या?

source: Quieter!
hi: और धीमे!

source: Definitely!
hi: निश्चित ही

source: If it rains tomorrow, will you stay at home?
hi: अगर कल बारिश हुई तो तुम घर में रहोगे क्या?

source: If you have time, please drop in on us.
hi: अगर आपके पास समय हो तो हमसे मिलने आईएगा।

source: If I had wings, I would fly to you.
hi: अगर मेरे पास पंख होते तो मैं उड़कर तुम्हारे पास चला आता।

source: With a little more patience, you would have succeeded.
hi: अगर तुममें थोड़ा और सब्र होता तो तुम कामयाब हो जाते।

source: To investigate the incident would take us at least three weeks.
hi: हमको इस घटना की तहकीकात करने में कम-से-कम तीन हफ़्ते लगेंगे।

source: If the coffee is too strong, add some more water.
hi: अगर कॉफ़ी ज़्यादा कड़वी है तो थोड़ा और पानी डाललो।

source: If you are to finish the work before June, you will have to work much better.
hi: यदि आपने जून से पहले कार्य सम्पूर्ण करना है तो आपको अधिक अच्छा कार्य करना पड़ेगा.

source: Would you speak more slowly, please?
hi: आप थोड़ा धीरे बोल सकते हैं क्या?

source: It is almost 12 o'clock.
hi: बारह बजने वाले हैं।

source: It is time you left off your childish ways.
hi: अब तुम्हारा अपना बचपना छोड़ देने का समय आ गया है।

source: I must leave now.
hi: मुझे अब जाना होगा।

source: I can't stand it anymore.
hi: मुझसे और सहन नहीं होगा!

source: Give me another cup of tea.
hi: मुझे और एक कप चाय दे दो।

source: Will you have another cup of tea?
hi: एक और गिलास चाय लेंगे क्या?

source: Had he tried it once more, he would have succeeded in it.
hi: अगर उसने और एक बार कोशिश की होती, तो शायद वह सफल हो जाता.

source: We tried it again, but couldn't do it.
hi: हमने फिरसे करने की कोशीश की, पर नहीं कर पाए।

source: Try it once again.
hi: एक बार फिरसे कोशिश करो।

source: It is already dark.
hi: अभी से रात हो गई है।

source: There is no more room for a TV set.
hi: टीवी सेट के लिए और जगह नहीं है।

source: How about adding a little bit more salt?
hi: थोड़ा और नमक डाल दोगे?

source: Could you please speak a little bit more slowly?
hi: आप थोड़ा धीरे बोल सकते हैं क्या?

source: Almost.
hi: लगभग.

source: It's about time for the train to arrive.
hi: ट्रेन के आने का समय लगभग आ गया है।

source: It is almost ten o'clock.
hi: दस बजने वाले हैं।

source: It's already nine o'clock.
hi: नौ बज चुकें हैं।

source: One minute earlier, and they could have caught the bus.
hi: अगर वे एक और मिनट जल्दी पहुँचा होता तो उनकी बस छूट नहीं गई हुई होती।

source: Try again.
hi: फिर कोशिश कर।

source: It's already eleven o'clock. I must be leaving now.
hi: ग्यारह बज चुके हैं। मुझे चलना चाहिए।

source: Mary is interested in politics.
hi: मेरी को राजनीति में दिलचस्पी है।

source: Mary prided herself on her beauty.
hi: मेरी को अपनी सुंदरता पर बहुत नाज़ था।

source: Merry is scared of dogs.
hi: मेरी कुत्तों से डरती है।

source: They speak Spanish in Mexico.
hi: मेक्सिको में स्पेनिश बोली जाती है।

source: Is Spanish spoken in Mexico?
hi: मेक्सिको में स्पैनिश बोली जाती है क्या?

source: Spanish is spoken in Mexico.
hi: मेक्सिको में स्पैनिश बोली जाती है।

source: Mary resembles her mother in appearance, but not in character.
hi: मेरी दिखने में तो अपनी माँ की तरह है पर चरित्र में अलग है।

source: Mary is tall.
hi: मैरी लंबी है।

source: Mary is setting by money to go to Japan.
hi: मेरी जापान जाने के लिए पैसे जुटा रही है।

source: Mary understands Chinese.
hi: मेरी चीनी समझती है।

source: Mary can swim.
hi: मैरी को तैरना आता है।

source: Are there enough chairs to go around?
hi: कुरसियाँ काफ़ी हैं क्या?

source: Cheese is made from milk.
hi: चीज़ दूध से बनता है।

source: Stop beating around the bush.
hi: घूमफिरकर बात मत करो, सीधे-सीधे बोलो।

source: Mayuko can ride a bicycle.
hi: मायुको साईकल चला सकती है।

source: I began to sing when I was a youngster.
hi: मैंने छोटी उम्र से ही गाना गाना शुरू कर दिया था।

source: I haven't had a chance to see the movie yet.
hi: मुझे अभी तक उस फ़िल्म को देखने का मौका नहीं मिला है।

source: I'll see you later.
hi: बाद में मिलेंगे।

source: I have not finished the task yet.
hi: मैंने अभी काम ख़तम नहीं किया है।

source: A friend in need is a friend indeed.
hi: दोस्त जो मुसीबत में काम आए।

source: Believe it or not, she has three children.
hi: मानो या न मानो, उसके तीन बच्चे हैं।

source: Mother Teresa was a Catholic nun who lived and worked in Calcutta, India.
hi: मदर टेरेसा एक कैथोलिक नन थीं जो कलकत्ता में रहतीं और काम करतीं थीं।

source: Mother Teresa used the prize money for her work in India and around the world.
hi: मदर टेरेसा को जो इनाम में पैसे मिले, उन्होंने उन पैसों को भारत और विदोश दोनों में अपने काम में लगाया।

source: You reap what you sow.
hi: जैसी करनी वैसी भरनी।

source: Mike speaks good Japanese.
hi: माईक अच्छी जापानी बोल लेता है।

source: Mike takes after his father in everything.
hi: माईक हर पहलू में अपने पापा जैसा है।

source: Mike and his sister can speak French, but they can't speak Japanese.
hi: माइक और उसकी बहन को फ़्रांसीसी बोलने आती हैं, मगर उन्हें जापानी नहीं आती।

source: How are you, Mike?
hi: कैसे हो, माईक?

source: I sort of like him.
hi: मुझे वह अच्छा सा लगता है।

source: Oh, my God!
hi: हे मेरे भगवान!

source: Only a few people listened to him.
hi: उसकी बात कुछ ही लोगों ने सुनी।

source: Mr White has gone to India.
hi: व्हाईट-जी भारत गए हुए हैं।

source: Would you mind turning down the volume?
hi: आवाज़ थोड़ी धीमी कर सकते हो क्या?

source: Here comes the train.
hi: लो, आ गई ट्रेन।

source: It's starting now.
hi: शुरू हो रहा है।

source: Bob entered the house through a window.
hi: बॉब घर में खिड़की से घुसा।

source: Bob came here, didn't he?
hi: बॉब यहाँ आया था ना?

source: We won't start till Bob comes.
hi: हम बॉब के आ जाने तक शुरू नहीं करेंगे।

source: Bob helped me.
hi: बॉब ने मेरी मदद की।

source: I don't know when Bob came to Japan.
hi: बॉब जापान कब आया मुझे पता नही।

source: Almost all the leaves have fallen.
hi: लगभग सारी-की-सारी पत्तियाँ गिर चुकीं हैं।

source: Almost all Japanese boys like to play baseball.
hi: लगभग सारे जापानी लड़कों को बास्केटबॉल खेलना अच्छा लगता है।
